; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 2559)
	(= (fuel plane1) 527)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city2)
	(= (capacity plane2) 7594)
	(= (fuel plane2) 369)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city3)
	(= (capacity plane3) 5848)
	(= (fuel plane3) 1044)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 4)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city8)
	(= (capacity plane4) 2384)
	(= (fuel plane4) 141)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 5)
	(at person1 city3)
	(at person2 city7)
	(at person3 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 799)
	(= (distance city0 city2) 587)
	(= (distance city0 city3) 738)
	(= (distance city0 city4) 569)
	(= (distance city0 city5) 733)
	(= (distance city0 city6) 931)
	(= (distance city0 city7) 844)
	(= (distance city0 city8) 590)
	(= (distance city1 city0) 799)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 787)
	(= (distance city1 city3) 591)
	(= (distance city1 city4) 661)
	(= (distance city1 city5) 806)
	(= (distance city1 city6) 854)
	(= (distance city1 city7) 712)
	(= (distance city1 city8) 816)
	(= (distance city2 city0) 587)
	(= (distance city2 city1) 787)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 708)
	(= (distance city2 city4) 675)
	(= (distance city2 city5) 742)
	(= (distance city2 city6) 892)
	(= (distance city2 city7) 795)
	(= (distance city2 city8) 591)
	(= (distance city3 city0) 738)
	(= (distance city3 city1) 591)
	(= (distance city3 city2) 708)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 996)
	(= (distance city3 city5) 568)
	(= (distance city3 city6) 761)
	(= (distance city3 city7) 572)
	(= (distance city3 city8) 564)
	(= (distance city4 city0) 569)
	(= (distance city4 city1) 661)
	(= (distance city4 city2) 675)
	(= (distance city4 city3) 996)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 688)
	(= (distance city4 city6) 916)
	(= (distance city4 city7) 958)
	(= (distance city4 city8) 656)
	(= (distance city5 city0) 733)
	(= (distance city5 city1) 806)
	(= (distance city5 city2) 742)
	(= (distance city5 city3) 568)
	(= (distance city5 city4) 688)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 647)
	(= (distance city5 city7) 757)
	(= (distance city5 city8) 744)
	(= (distance city6 city0) 931)
	(= (distance city6 city1) 854)
	(= (distance city6 city2) 892)
	(= (distance city6 city3) 761)
	(= (distance city6 city4) 916)
	(= (distance city6 city5) 647)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 885)
	(= (distance city6 city8) 827)
	(= (distance city7 city0) 844)
	(= (distance city7 city1) 712)
	(= (distance city7 city2) 795)
	(= (distance city7 city3) 572)
	(= (distance city7 city4) 958)
	(= (distance city7 city5) 757)
	(= (distance city7 city6) 885)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 977)
	(= (distance city8 city0) 590)
	(= (distance city8 city1) 816)
	(= (distance city8 city2) 591)
	(= (distance city8 city3) 564)
	(= (distance city8 city4) 656)
	(= (distance city8 city5) 744)
	(= (distance city8 city6) 827)
	(= (distance city8 city7) 977)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city2)
	(at person3 city3)
	))

(:metric minimize (+ (* 2 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane3 city3)
   changed: (fuel plane3) from 1044 to 5848
   goals met: 1 of 3
2. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 3
3. (fly plane3 city3 city7)
   deleted: (at plane3 city3)
   added: (at plane3 city7)
   changed: (total-fuel-used) from 0 to 1144, (fuel plane3) from 5848 to 4704
   goals met: 1 of 3
4. (board person2 plane3 city7)
   deleted: (at person2 city7)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 3
5. (fly plane3 city7 city2)
   deleted: (at plane3 city7)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 1144 to 2734, (fuel plane3) from 4704 to 3114
   goals met: 1 of 3
6. (debark person1 plane3 city2)
   deleted: (in person1 plane3)
   added: (at person1 city2)
   changed: (onboard plane3) from 2 to 1
   goals met: 2 of 3
7. (debark person2 plane3 city2)
   deleted: (in person2 plane3)
   added: (at person2 city2)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 3
